Revit 2024 API
ColorFillSchemeEntry Constructor
 Creates new ColorFillSchemeEntry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public ColorFillSchemeEntry(
	StorageType storageType
)
Visual Basic
Public Sub New ( _
	storageType As StorageType _
)
Visual C++
public:
ColorFillSchemeEntry(
	StorageType storageType
)
Parameters
storageType
Type: Autodesk.Revit.DB.StorageType
 The type of data that could be stored into this entry.
Remarks
 A new created ColorFillSchemeEntry should be assigned proper value before it is applied to a [!:Autodesk::Revit::DB::ColorFillScheme]. If the Color and Caption properties are not set, Revit will generate them automatically after the ColorFillSchemeEntry is applied to the ColorFillScheme.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
ColorFillSchemeEntry Class
Autodesk.Revit.DB Namespace